Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_crc32_hw.c
#include "rx_crc_internal.h"

#ifdef RX_CRC32_USE_HARDWARE

#include <stddef.h>

#include "rx72n_regs.h"
#include "rx_check.h"
#include "rx_gpio_constants.h"
#include "rx_register_protection.h"

/* =============================================================================
 * CRC Hardware Constants
 * =============================================================================
 */

/**
 * @brief CRC hardware constants
 *
 * Note: Protection register constants are from rx_register_protection.h
 */
typedef enum : int32_t {
  k_crc_ieee_final_xor = -1, /**< IEEE 802.3 CRC-32 final XOR (0xFFFFFFFF as signed int32_t) */
} rx_crc_hw_constants_t;

/**
 * @brief CRC hardware-specific constants
 *
 * Shared loop constants (k_crc_len_min, k_crc_len_max, k_crc_idx_start) are
 * defined in rx_crc_internal.h to ensure consistency across implementations.
 */
typedef enum : uint32_t {
  k_crc_result_invalid = 0, /**< Invalid CRC result (error case) */
  k_crc_bit_set        = 1, /**< Bit set value for register manipulation */
} rx_crc_hw_loop_constants_t;

/* =============================================================================
 * Module State
 * =============================================================================
 */

static bool s_crc_initialized = false;

/* =============================================================================
 * Hardware CRC Implementation
 * =============================================================================
 */

/**
 * @brief Initialize RX72N CRC Calculator peripheral for IEEE 802.3 CRC-32
 *
 * @details
 * Enables the hardware CRC module by clearing the module stop bit (MSTPCRB[23])
 * and configures the peripheral for IEEE 802.3 CRC-32 polynomial with LSB-first
 * bit reflection (compatible with `crc32.ChecksumIEEE()` in Go).
 *
 * This function is **idempotent** - calling it multiple times is safe and returns
 * success immediately if already initialized.
 *
 * ## Initialization Sequence
 *
 * **Hardware setup steps (6 operations):**
 * 1. Check if already initialized → return k_rx_ok (fast path)
 * 2. Validate system register accessibility (NULL checks)
 * 3. Unlock protection register (PRCR = 0xA503 for PRC1+PRC3)
 * 4. Clear MSTPCRB bit 23 (enable CRC module clock)
 * 5. Lock protection register (PRCR = 0xA500)
 * 6. Configure CRCCR = 0xC3 (CRC-32 + LSB-first + clear)
 * 7. Set s_crc_initialized flag
 *
 * **Total execution time:** ~0.5 µs @ 240 MHz (register writes only)
 *
 * ## CRCCR Configuration
 *
 * **Control register value:** 0xC3 (binary: 0b11000011)
 *
 * | Bit | Name | Value | Description |
 * |-----|------|-------|-------------|
 * | [7] | DORCLR | 1 | Clear output (ready for first CRC) |
 * | [6] | LMS | 1 | LSB-first mode (bit reflection) |
 * | [5:2] | Reserved | 0 | Must be 0 |
 * | [1:0] | GPS | 0b11 | CRC-32 polynomial (0x04C11DB7) |
 *
 * **Why LSB-first (LMS=1):**
 * - IEEE 802.3 reflects input/output bits
 * - Matches Ethernet CRC behavior
 * - Compatible with Go's `crc32.ChecksumIEEE()`
 * - Compatible with Python's `zlib.crc32()`
 *
 * ## Module Stop Control
 *
 * **MSTPCRB register (0x00080014):**
 * - Bit 23: CRC Calculator module stop
 * - Default: 1 (stopped, clock gated)
 * - Initialized: 0 (running, clock enabled)
 *
 * **Protection unlock sequence:**
 * ```
 * PRCR = 0xA503  // Unlock PRC1 + PRC3
 * MSTPCRB &= ~(1 << 23)  // Clear bit 23
 * PRCR = 0xA500  // Lock (write 0xA5 + 0x00)
 * ```
 *
 * ## Thread Safety
 *
 * **This function is thread-safe:**
 * - Idempotent: Multiple calls safe (early return if initialized)
 * - Race condition: Two threads initializing simultaneously → both succeed
 * - Worst case: Redundant hardware config (harmless)
 * - s_crc_initialized flag: Write-once, read-many (safe pattern)
 *
 * ## Performance
 *
 * | Metric | Value | Notes |
 * |--------|-------|-------|
 * | **Execution time** | ~0.5 µs | First call (hardware config) |
 * | **Execution time (cached)** | ~0.05 µs | Subsequent calls (early return) |
 * | **CPU cycles** | ~120 cycles | Register writes + protection unlock |
 * | **Blocking time** | 0 cycles | No busy-wait (instant config) |
 *
 * @return rx_err_t Error code indicating initialization result
 * @retval k_rx_ok Success - CRC module initialized and configured
 * @retval k_rx_err_null_ptr System registers not accessible (critical hardware fault)
 *
 * @pre System must be powered and clocked (RX72N running)
 * @pre Protection registers must be accessible (PRCR unlockable)
 *
 * @post CRC module clock enabled (MSTPCRB[23] = 0)
 * @post CRCCR configured for IEEE 802.3 CRC-32 (GPS=0b11, LMS=1)
 * @post s_crc_initialized flag set to true
 * @post Peripheral ready for rx_crc32_ieee_impl() calls
 *
 * @note **Idempotent:** Safe to call multiple times (fast return if already init)
 * @note **Thread-safe:** Multiple threads can call simultaneously (harmless race)
 * @note **No deinit:** Module remains enabled for continuous availability (see rx_crc_deinit)
 * @note **Power:** CRC peripheral adds ~2 mA when active (minimal impact)
 *
 * @warning Do NOT manually write to MSTPCRB without protection unlock (ignored)
 * @warning Do NOT call from interrupt context (protection unlock may fail)
 *
 * @par Example 1: Basic Initialization
 * @code{.c}
 * #include "rx_crc.h"
 *
 * void system_init(void) {
 *   rx_err_t err = rx_crc_init();
 *   if (err != k_rx_ok) {
 *     rx_log_error("SYSTEM", "CRC init failed");
 *     // Fatal error - cannot validate SPI/USB frames
 *     while (1);
 *   }
 *
 *   rx_log_info("SYSTEM", "CRC module ready");
 * }
 * @endcode
 *
 * @par Example 2: Lazy Initialization (Automatic)
 * @code{.c}
 * #include "rx_crc.h"
 *
 * // No need to call rx_crc_init() explicitly
 * // rx_crc32_ieee_impl() will auto-initialize if needed
 * void process_spi_frame(const uint8_t* frame, uint32_t len) {
 *   // First call triggers auto-init
 *   uint32_t crc = rx_crc32_ieee(frame, len);
 *   // Subsequent calls use initialized peripheral
 * }
 * @endcode
 *
 * @par Example 3: Error Handling
 * @code{.c}
 * #include "rx_crc.h"
 * #include "rx_log.h"
 *
 * rx_err_t safe_crc_init(void) {
 *   rx_err_t err = rx_crc_init();
 *
 *   if (err == k_rx_err_null_ptr) {
 *     rx_log_error("CRC", "Hardware fault: registers not accessible");
 *     return err;
 *   }
 *
 *   if (err != k_rx_ok) {
 *     rx_log_error("CRC", "Unknown init error: %d", err);
 *     return err;
 *   }
 *
 *   // Verify peripheral is responsive
 *   if (crc_regs() == nullptr) {
 *     rx_log_error("CRC", "Peripheral not responding after init");
 *     return k_rx_err_hardware;
 *   }
 *
 *   return k_rx_ok;
 * }
 * @endcode
 *
 * @see rx_crc_deinit() Deinitialize CRC module (no-op in this implementation)
 * @see rx_crc32_ieee_impl() Calculate CRC using initialized peripheral
 * @see crc_regs() Access CRC peripheral registers
 * @see system_regs() Access system registers (PRCR, MSTPCRB)
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 4: ✓ 28-line function (single responsibility: HW init)
 * - Rule 5: ✓ 2 preconditions (register accessibility), 3 postconditions (clock, config, flag)
 * - Rule 7: ✓ No unchecked return values
 */
rx_err_t rx_crc_init(void)
{
  /* Pre-condition: Validate system registers are accessible (NASA Rule 5) */
  RX_CHECK_NULL_PTR(system_regs(), "CRC", "System registers not accessible");
  RX_CHECK_NULL_PTR(crc_regs(), "CRC", "CRC registers not accessible");

