Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_crc/src/rx_crc32_hw.c
  /*
     * Clear the CRC data output register to start fresh calculation.
     * Setting DORCLR bit resets the internal CRC state to the initial value.
     *
     * For IEEE 802.3, the initial value is 0xFFFFFFFF. The RX72N hardware
     * handles this automatically when DORCLR is set.
     */
  crc_regs()->crccr |= k_crc_crccr_dorclr;

  /*
     * Feed data bytes to the CRC calculator.
     *
     * The hardware processes each byte through the CRC polynomial.
     * We write bytes via pointer cast to the CRCDIR register address.
     *
     * Note: For large aligned buffers, 32-bit word writes could be faster,
     * but byte-wise ensures correctness for all cases.
     *
     * NASA Rule 2: Loop bounded by k_crc_len_max (compile-time constant)
     */
  crcdir_byte = (volatile uint8_t*)&crc_regs()->crcdir;
  for (i = k_crc_idx_start; i < k_crc_len_max; i++) {
    if (i >= len) {
      break;
    }
    *crcdir_byte = data[i];
  }

  /*
     * Read result and apply IEEE 802.3 finalization.
     *
     * IEEE 802.3 requires XOR with 0xFFFFFFFF after calculation.
     * The hardware outputs the raw CRC value, so we apply the final XOR.
     *
     * Post-condition: Result is valid IEEE 802.3 CRC-32 (NASA Rule 5)
     */
  return crc_regs()->crcdor ^ k_crc_ieee_final_xor;
}

/**
 * @brief Update CRC-32 with additional data (software fallback)
 *
 * Computes incremental CRC-32 by updating a previous CRC value with new data.
 * Uses software implementation because RX72N hardware doesn't support
 * loading arbitrary initial CRC state.
 *
 * @param[in] crc Previous CRC value to continue from
 * @param[in] data Pointer to new data buffer
 * @param[in] len Length of new data in bytes
 *
 * @return Updated CRC-32 checksum
 *
 * @pre data must be non-NULL
 * @pre len must be in valid range
 */
uint32_t rx_crc32_update_impl(uint32_t crc, const uint8_t* data, uint32_t len)
{
  /*
     * Use software fallback for incremental CRC.
     *
     * Rationale:
     * The RX72N CRC hardware doesn't support loading an arbitrary initial
     * CRC value. For incremental CRC (updating a previous CRC with new data),
     * we would need to:
     * 1. Un-finalize the input CRC (XOR with 0xFFFFFFFF)
     * 2. Load it into the hardware state
     * 3. Process new data
     * 4. Re-finalize
     *
     * The hardware's DORCLR resets to a fixed initial value, making step 2
     * problematic. Rather than complex state manipulation, we use the
     * software implementation which handles this cleanly.
     *
     * Performance note: Incremental CRC is typically used for small chunks
     * in streaming scenarios, where the software overhead is acceptable.
     */

  /* Pre-condition: Validate input parameters (NASA Rule 5) */
  RX_CHECK_NULL_PTR(data, "CRC", "CRC update data pointer is nullptr");
  RX_CHECK_RANGE_TAG(len, k_crc_len_min, k_crc_len_max, k_crc_result_invalid, "CRC");

  /* Delegate to software implementation */
  return rx_crc32_update_sw(crc, data, len);
}

#endif /* RX_CRC32_USE_HARDWARE */
